# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'git-flow'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts


# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'flipper' # mobile app debugging
brew 'gdal'   # geospatial data
brew 'imagemagick'  # Needed to install fonts
brew 'jenv'   # Java version manager
brew 'java'   # Java 8
brew 'mactex'   # LaTeX
brew 'pyenv'  # Python version manager
brew 'pyenv-virtualenv' # Python virtual environment manager
brew  'openssl readline sqlite3 xz zlib' # python build dependencies
brew 'pipx' # python package + virtual env manager
# brew 'anaconda' # anaconda python UI
brew 'kubectl'  # kubernetes
brew 'meilisearch'  # search engine
brew 'mysql'  # mysql database
brew 'nginx' # web server
brew 'node' # Node.js
brew 'pv' # pipeviewer (monitor data as it passes through a pipeline)
brew 'redis' # key-value store
brew 'tree' # tree view of directories
brew 'yarn' # node package manager

# libpostal (postal code parser) dependencies
brew 'curl'
brew 'autoconf'
brew 'automake'
brew 'libtool'
brew 'pkg-config'

# Apps
cask 'brewservicesmenubar'  # brew services manager
cask 'daisydisk'  # disk usage
# cask 'dbeaver'
cask 'pgadmin4'   # postgresql database admin
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'  # design
cask 'firefox'
cask 'flux'   # screen color temperature
cask 'gimp'   # image editor
cask 'google-chrome'
cask 'gpg-suite'        # One simple package with everything you need, to protect your emails and files.
cask 'helo'             # Painless local email testing for web developers.
cask 'imageoptim'       # makes images load faster
cask 'inkscape'
cask 'insomnia'         # Build APIs that work
cask 'iterm2'
cask 'fig'           # terminal multiplexer
cask 'malwarebytes'
cask 'meld'            # visual diff tool
cask 'monitorcontrol'   # Control your external monitor brightness
cask 'mysqlworkbench'   # mysql database admin
cask 'notion'        # All-in-one workspace
cask 'open-in-code'
cask 'openrefine'   # Ontology editor
cask 'pastebot'      # Clipboard manager
cask 'postman'     # API development
cask 'postico'   # Postgres database admin
cask 'protege'         # ontology editor
cask 'react-native-debugger'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tableplus'  # database admin
cask 'the-unarchiver' # unarchive files
cask 'transmit' # ftp client
cask 'tunnelbear'   # VPN
cask 'visual-studio-code'
cask 'xquartz'
cask 'zoom'
cask 'zotero'   # reference manager

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825